danielinux/m33mu/cpu/imxrt700/imxrt700_mmio.c
/* m33mu -- an ARMv8-M Emulator
 *
 * Copyright (C) 2025  Daniele Lacamera <root@danielinux.net>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Affero General Public License as published
 * by the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 *
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "imxrt700/imxrt700_mmio.h"
#include "imxrt700/imxrt700_svd_regs.h"
#include "imxrt700/imxrt700_flexcomm.h"
#include "imxrt700/imxrt700_timers.h"
#include "imxrt700/imxrt700_multicore.h"
#include "imxrt700/imxrt700_secure.h"
#include "imxrt700/imxrt700_romapi.h"
#include "imxrt700/imxrt700_xspi.h"
#include "imxrt700/cpu_config.h"

#define PERIPH_WINDOW_SIZE 0x10000000u
#define PAGE_SHIFT 12u
#define PAGE_COUNT (PERIPH_WINDOW_SIZE >> PAGE_SHIFT)
#define PAGE_SLOTS 2u
#define NO_DEV 0xFFFFu

#define DEV_TOTAL (IMXRT700_SVD_DEV_COUNT + IMXRT700_SVD_ALIAS_COUNT)

/* devs[0 .. IMXRT700_SVD_DEV_COUNT-1] own storage; the alias entries after
 * them (GPIOn_ALIAS, AHBSCn_ALIASk, ...) share their parent's storage. */
static struct imxrt700_dev devs[DEV_TOTAL];
static mm_u16 dev_parent[DEV_TOTAL];
static mm_u16 page_map[PAGE_COUNT][PAGE_SLOTS];
static mm_bool devs_ready = MM_FALSE;
static mm_bool access_secure = MM_FALSE;
static struct mm_nvic *nvics[2];
static struct mm_memmap *bound_map;
static mm_u8 *bound_flash;
static mm_u32 bound_flash_size;
static mm_bool unmapped_warned;

static const mm_u8 window_ns = 0u;
static const mm_u8 window_s = 1u;

static mm_bool trace_enabled(void)
{
    static int cached = -1;
    if (cached < 0) {
        cached = getenv("M33MU_IMXRT700_TRACE") != 0 ? 1 : 0;
    }
    return cached != 0;
}

/* ------------------------------------------------------------------------ */
/* Device table                                                             */
/* ------------------------------------------------------------------------ */

static mm_u16 dev_index_by_name(const char *name)
{
    mm_u16 i;
    for (i = 0; i < DEV_TOTAL; ++i) {
        if (devs[i].name != 0 && strcmp(devs[i].name, name) == 0) {
            return i;
        }
    }
    return NO_DEV;
}

static void page_add(mm_u32 base, mm_u32 size, mm_u16 idx)
{
    mm_u32 first = (base - IMXRT700_PERIPH_BASE_NS) >> PAGE_SHIFT;
    mm_u32 last = (base + size - 1u - IMXRT700_PERIPH_BASE_NS) >> PAGE_SHIFT;
    mm_u32 p;
    for (p = first; p <= last && p < PAGE_COUNT; ++p) {
        mm_u32 s;
        for (s = 0; s < PAGE_SLOTS; ++s) {
            if (page_map[p][s] == NO_DEV) {
                page_map[p][s] = idx;
                break;
            }
        }
        if (s == PAGE_SLOTS) {
            fprintf(stderr, "[IMXRT700] page 0x%08lx over-subscribed (%s)\n",
                    (unsigned long)(IMXRT700_PERIPH_BASE_NS + (p << PAGE_SHIFT)), devs[idx].name);
        }
    }
}

static void devs_build(void)
{
    mm_u32 i;
    mm_u32 total = 0;
    mm_u8 *pool;

    if (devs_ready) {
        return;
    }
    memset(page_map, 0xFF, sizeof(page_map));
    for (i = 0; i < IMXRT700_SVD_DEV_COUNT; ++i) {
        total += (imxrt700_svd_devs[i].size + 3u) & ~3u;
    }
    pool = (mm_u8 *)calloc(1u, total);
    if (pool == 0) {
        fprintf(stderr, "[IMXRT700] out of memory for register files\n");
        return;
    }
    for (i = 0; i < IMXRT700_SVD_DEV_COUNT; ++i) {
        const struct imxrt700_svd_dev *s = &imxrt700_svd_devs[i];
        devs[i].name = s->name;
        devs[i].base = s->base;
        devs[i].size = (s->size + 3u) & ~3u;
        devs[i].lo = s->lo;
        devs[i].domain = s->domain;
        devs[i].mem = pool;
        devs[i].svd = s;
        dev_parent[i] = (mm_u16)i;
        pool += devs[i].size;
        page_add(devs[i].base, devs[i].size, (mm_u16)i);
    }
    for (i = 0; i < IMXRT700_SVD_ALIAS_COUNT; ++i) {
        const struct imxrt700_svd_alias *a = &imxrt700_svd_aliases[i];
        mm_u32 idx = IMXRT700_SVD_DEV_COUNT + i;
        const struct imxrt700_dev *parent = &devs[a->dev];
        mm_u32 k;
        mm_bool dup = MM_FALSE;
        /* PUF_ALIASn and PUF_CTRL_ALIASn name the same slot. */
        for (k = IMXRT700_SVD_DEV_COUNT; k < idx; ++k) {
            if (devs[k].base == a->base) {
                dup = MM_TRUE;
            }
        }
        devs[idx].name = a->name;
        devs[idx].base = a->base;
        devs[idx].size = parent->size;
        devs[idx].lo = parent->lo;
        devs[idx].domain = parent->domain;
        devs[idx].mem = parent->mem;
        devs[idx].svd = parent->svd;
        dev_parent[idx] = a->dev;
        if (!dup) {
            page_add(devs[idx].base, devs[idx].size, (mm_u16)idx);
        }
    }
    devs_ready = MM_TRUE;
}

static struct imxrt700_dev *dev_lookup(mm_u32 ns_addr, mm_u32 *off_out, struct imxrt700_dev **alias_out)
{
    mm_u32 page = (ns_addr - IMXRT700_PERIPH_BASE_NS) >> PAGE_SHIFT;
    struct imxrt700_dev *best = 0;
    mm_u16 best_idx = NO_DEV;
    mm_u32 s;
    if (page >= PAGE_COUNT) {
        return 0;
    }
    for (s = 0; s < PAGE_SLOTS; ++s) {
        mm_u16 idx = page_map[page][s];
        struct imxrt700_dev *d;
        if (idx == NO_DEV) {
            continue;
        }
        d = &devs[idx];
        if (ns_addr < d->base + d->lo || ns_addr - d->base >= d->size) {
            continue;
        }
        if (best == 0 || d->size < best->size) {
            best = d;
            best_idx = idx;
        }
    }
    if (best == 0) {
        return 0;
    }
    *off_out = ns_addr - best->base;
    if (alias_out != 0) {
        *alias_out = best;
    }
    return &devs[dev_parent[best_idx]];
}

