danielinux/m33mu/cpu/imxrt700/imxrt700_mmio.c
struct imxrt700_dev *mm_imxrt700_dev(const char *name)
{
    mm_u16 idx;
    devs_build();
    idx = dev_index_by_name(name);
    if (idx == NO_DEV) {
        return 0;
    }
    return &devs[dev_parent[idx]];
}

mm_bool mm_imxrt700_dev_hook(const char *name,
                             imxrt700_read_hook read,
                             imxrt700_write_hook write,
                             void *opaque)
{
    struct imxrt700_dev *d = mm_imxrt700_dev(name);
    if (d == 0) {
        fprintf(stderr, "[IMXRT700] no SVD block named %s\n", name);
        return MM_FALSE;
    }
    d->read = read;
    d->write = write;
    d->opaque = opaque;
    return MM_TRUE;
}

/* ------------------------------------------------------------------------ */
/* Register file                                                            */
/* ------------------------------------------------------------------------ */

static const struct imxrt700_svd_reg *svd_reg(const struct imxrt700_dev *dev, mm_u32 off)
{
    const struct imxrt700_svd_dev *s = (const struct imxrt700_svd_dev *)dev->svd;
    mm_u32 i;
    if (s == 0 || s->regs == 0) {
        return 0;
    }
    for (i = 0; i < s->nregs; ++i) {
        if (s->regs[i].off == off) {
            return &s->regs[i];
        }
        if (s->regs[i].off > off) {
            break;
        }
    }
    return 0;
}

mm_u32 mm_imxrt700_reg(const struct imxrt700_dev *dev, mm_u32 off)
{
    const mm_u8 *p;
    if (dev == 0 || dev->mem == 0 || off + 4u > dev->size) {
        return 0;
    }
    p = dev->mem + off;
    return (mm_u32)p[0] | ((mm_u32)p[1] << 8) | ((mm_u32)p[2] << 16) | ((mm_u32)p[3] << 24);
}

void mm_imxrt700_reg_put(struct imxrt700_dev *dev, mm_u32 off, mm_u32 value)
{
    mm_u8 *p;
    if (dev == 0 || dev->mem == 0 || off + 4u > dev->size) {
        return;
    }
    p = dev->mem + off;
    p[0] = (mm_u8)value;
    p[1] = (mm_u8)(value >> 8);
    p[2] = (mm_u8)(value >> 16);
    p[3] = (mm_u8)(value >> 24);
}

mm_bool mm_imxrt700_regfile_read(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 *value_out)
{
    mm_u32 word_off = off & ~3u;
    mm_u32 shift = (off & 3u) * 8u;
    mm_u32 v;
    const struct imxrt700_svd_reg *r;
    if (dev == 0 || value_out == 0 || off + size > dev->size) {
        return MM_FALSE;
    }
    r = svd_reg(dev, word_off);
    if (r != 0 && r->kind != IMXRT700_REG_PLAIN) {
        v = 0u; /* SET/CLR/TOG aliases are write-only */
    } else {
        v = mm_imxrt700_reg(dev, word_off);
        if (r != 0) {
            v &= ~r->rz;
        }
    }
    v >>= shift;
    if (size == 1u) {
        v &= 0xFFu;
    } else if (size == 2u) {
        v &= 0xFFFFu;
    }
    *value_out = v;
    return MM_TRUE;
}

mm_bool mm_imxrt700_regfile_write(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 value)
{
    mm_u32 word_off = off & ~3u;
    mm_u32 shift = (off & 3u) * 8u;
    mm_u32 mask;
    mm_u32 cur;
    const struct imxrt700_svd_reg *r;
    if (dev == 0 || off + size > dev->size) {
        return MM_FALSE;
    }
    mask = (size == 4u) ? 0xFFFFFFFFu : (((1u << (size * 8u)) - 1u) << shift);
    value = (value << shift) & mask;
    r = svd_reg(dev, word_off);
    if (r != 0 && r->kind != IMXRT700_REG_PLAIN) {
        cur = mm_imxrt700_reg(dev, r->target);
        if (r->kind == IMXRT700_REG_SET) {
            cur |= value;
        } else if (r->kind == IMXRT700_REG_CLR) {
            cur &= ~value;
        } else {
            cur ^= value;
        }
        mm_imxrt700_reg_put(dev, r->target, cur);
        return MM_TRUE;
    }
    cur = mm_imxrt700_reg(dev, word_off);
    cur = (cur & ~mask) | value;
    if (r != 0) {
        cur &= ~r->rz;
    }
    mm_imxrt700_reg_put(dev, word_off, cur);
    return MM_TRUE;
}

static void devs_reset(void)
{
    mm_u32 i;
    devs_build();
    for (i = 0; i < IMXRT700_SVD_DEV_COUNT; ++i) {
        const struct imxrt700_svd_dev *s = &imxrt700_svd_devs[i];
        mm_u32 k;
        if (devs[i].mem == 0) {
            continue;
        }
        memset(devs[i].mem, 0, devs[i].size);
        for (k = 0; k < s->nregs; ++k) {
            if (s->regs[k].kind == IMXRT700_REG_PLAIN) {
                mm_imxrt700_reg_put(&devs[i], s->regs[k].off, s->regs[k].reset);
            }
        }
    }
}

/* ------------------------------------------------------------------------ */
/* Clock / reset / power: status bits firmware polls                        */
/* ------------------------------------------------------------------------ */

struct force_bits {
    const char *dev;
    mm_u32 off;
    mm_u32 set;
};

/* Oscillators and PLLs are modelled as always settled. */
static const struct force_bits ready_bits[] = {
    { "CLKCTL0", 0x118u, 0x00000003u },  /* FRO01CLKSTATUS: FRO0/FRO1 CLK_OK */
    { "CLKCTL0", 0x200u, 0x03000000u },  /* FRO1 CSR: TRIM_LOCK | TUNEONCE_DONE */
    { "FRO0", 0x200u, 0x03000000u },
    { "FRO2", 0x200u, 0x03000000u },
    { "CLKCTL3", 0x290u, 0x00000001u },  /* FRO2CLKSTATUS: CLK_OK */
    { "CLKCTL2", 0x218u, 0x40404040u },  /* MAINPLL0PFD: PFDn_CLKRDY */
    { "CLKCTL2", 0x418u, 0x40404040u },  /* AUDIOPLL0PFD: PFDn_CLKRDY */
    { "OSC32KNP", 0x008u, 0x00000003u }, /* STAT: TCXO/SCXO_STABLE */
};

static mm_bool status_read(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 *value_out)
{
    mm_u32 i;
    if (!mm_imxrt700_regfile_read(dev, off, size, value_out)) {
        return MM_FALSE;
    }
    for (i = 0; i < sizeof(ready_bits) / sizeof(ready_bits[0]); ++i) {
        if (strcmp(ready_bits[i].dev, dev->name) == 0 && ready_bits[i].off == (off & ~3u)) {
            *value_out |= ready_bits[i].set >> ((off & 3u) * 8u);
        }
    }
    return MM_TRUE;
}

mm_bool mm_imxrt700_clock_on(const char *clkctl, mm_u32 pscctl_off, mm_u32 bit)
{
    struct imxrt700_dev *d = mm_imxrt700_dev(clkctl);
    return (d != 0 && (mm_imxrt700_reg(d, pscctl_off) & (1u << bit)) != 0u) ? MM_TRUE : MM_FALSE;
}

mm_bool mm_imxrt700_reset_released(const char *rstctl, mm_u32 prstctl_off, mm_u32 bit)
{
    struct imxrt700_dev *d = mm_imxrt700_dev(rstctl);
    return (d != 0 && (mm_imxrt700_reg(d, prstctl_off) & (1u << bit)) == 0u) ? MM_TRUE : MM_FALSE;
}

/* ------------------------------------------------------------------------ */
/* RGPIO                                                                    */
/* ------------------------------------------------------------------------ */

#define RGPIO_PDOR 0x40u
#define RGPIO_PSOR 0x44u
#define RGPIO_PCOR 0x48u
#define RGPIO_PTOR 0x4Cu
#define RGPIO_PDIR 0x50u
#define RGPIO_PDDR 0x54u

static mm_bool gpio_read(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 *value_out)
{
    if (off == RGPIO_PDIR && size == 4u) {
        /* No external stimulus: outputs read back what they drive. */
        *value_out = mm_imxrt700_reg(dev, RGPIO_PDOR) & mm_imxrt700_reg(dev, RGPIO_PDDR);
        return MM_TRUE;
    }
    if ((off == RGPIO_PSOR || off == RGPIO_PCOR || off == RGPIO_PTOR) && size == 4u) {
        *value_out = 0u;
        return MM_TRUE;
    }
    return MM_FALSE;
}

static mm_bool gpio_write(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 value)
{
    mm_u32 pdor = mm_imxrt700_reg(dev, RGPIO_PDOR);
    if (size != 4u) {
        return MM_FALSE;
    }
    switch (off) {
    case RGPIO_PSOR:
        pdor |= value;
        break;
    case RGPIO_PCOR:
        pdor &= ~value;
        break;
    case RGPIO_PTOR:
        pdor ^= value;
        break;
    case RGPIO_PDIR:
        return MM_TRUE; /* read-only */
    default:
        return MM_FALSE;
    }
    mm_imxrt700_reg_put(dev, RGPIO_PDOR, pdor);
    return MM_TRUE;
}

/* ------------------------------------------------------------------------ */
/* CRC (DATA / GPOLY / CTRL engine)                                         */
/* ------------------------------------------------------------------------ */

#define CRC_DATA 0x0u
#define CRC_GPOLY 0x4u
#define CRC_CTRL 0x8u
#define CRC_CTRL_TCRC (1u << 24)
#define CRC_CTRL_WAS (1u << 25)
#define CRC_CTRL_FXOR (1u << 26)

static mm_u32 crc_state;

