danielinux/m33mu/cpu/imxrt700/imxrt700_mmio.c
static mm_u32 bitrev(mm_u32 v, mm_u32 bits)
{
    mm_u32 r = 0;
    mm_u32 i;
    for (i = 0; i < bits; ++i) {
        r = (r << 1) | ((v >> i) & 1u);
    }
    return r;
}

static mm_u32 crc_transpose(mm_u32 v, mm_u32 bytes, mm_u32 type)
{
    mm_u32 out = 0;
    mm_u32 i;
    switch (type & 3u) {
    case 1u: /* bits within bytes */
        for (i = 0; i < bytes; ++i) {
            out |= bitrev((v >> (i * 8u)) & 0xFFu, 8u) << (i * 8u);
        }
        return out;
    case 2u: /* bits and bytes */
        return bitrev(v, bytes * 8u);
    case 3u: /* bytes only */
        for (i = 0; i < bytes; ++i) {
            out |= ((v >> (i * 8u)) & 0xFFu) << ((bytes - 1u - i) * 8u);
        }
        return out;
    default:
        return v;
    }
}

static mm_bool crc_read(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 *value_out)
{
    mm_u32 ctrl = mm_imxrt700_reg(dev, CRC_CTRL);
    mm_u32 v;
    if (off >= 4u) {
        return MM_FALSE;
    }
    v = crc_transpose(crc_state, 4u, ctrl >> 28);
    if (ctrl & CRC_CTRL_FXOR) {
        v ^= (ctrl & CRC_CTRL_TCRC) ? 0xFFFFFFFFu : 0xFFFFu;
    }
    v >>= off * 8u;
    if (size == 1u) v &= 0xFFu;
    if (size == 2u) v &= 0xFFFFu;
    *value_out = v;
    return MM_TRUE;
}

static mm_bool crc_write(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 value)
{
    mm_u32 ctrl = mm_imxrt700_reg(dev, CRC_CTRL);
    mm_bool wide = (ctrl & CRC_CTRL_TCRC) ? MM_TRUE : MM_FALSE;
    mm_u32 poly = mm_imxrt700_reg(dev, CRC_GPOLY);
    mm_u32 width = wide ? 32u : 16u;
    mm_u32 topbit = 1u << (width - 1u);
    mm_u32 wmask = wide ? 0xFFFFFFFFu : 0xFFFFu;
    mm_u32 data;
    mm_u32 bits;
    mm_u32 i;
    if (off >= 4u) {
        return MM_FALSE;
    }
    if (ctrl & CRC_CTRL_WAS) {
        mm_u32 mask = (size == 4u) ? 0xFFFFFFFFu : (((1u << (size * 8u)) - 1u) << (off * 8u));
        crc_state = (crc_state & ~mask) | ((value << (off * 8u)) & mask);
        return MM_TRUE;
    }
    data = crc_transpose(value, size, (ctrl >> 30) & 3u);
    bits = size * 8u;
    poly &= wmask;
    for (i = 0; i < bits; ++i) {
        mm_u32 in = (data >> (bits - 1u - i)) & 1u;
        mm_u32 top = ((crc_state & topbit) ? 1u : 0u) ^ in;
        crc_state = (crc_state << 1) & wmask;
        if (top) {
            crc_state ^= poly;
        }
    }
    return MM_TRUE;
}

/* ------------------------------------------------------------------------ */
/* Dispatcher                                                               */
/* ------------------------------------------------------------------------ */

mm_bool mm_imxrt700_access_secure(void)
{
    return access_secure;
}

static mm_bool window_read(void *opaque, mm_u32 offset, mm_u32 size, mm_u32 *value_out)
{
    const mm_u8 *win = (const mm_u8 *)opaque;
    mm_u32 ns_addr = IMXRT700_PERIPH_BASE_NS + offset;
    mm_u32 off = 0;
    struct imxrt700_dev *alias = 0;
    struct imxrt700_dev *dev;
    mm_bool ok;

    if (value_out == 0 || size == 0u || size > 4u) {
        return MM_FALSE;
    }
    dev = dev_lookup(ns_addr, &off, &alias);
    access_secure = (*win == window_s) ? MM_TRUE : MM_FALSE;
    if (dev == 0) {
        if (!unmapped_warned || trace_enabled()) {
            fprintf(stderr, "[IMXRT700] read from unmapped peripheral address 0x%08lx (RAZ)\n",
                    (unsigned long)(ns_addr | (access_secure ? 0x10000000u : 0u)));
            unmapped_warned = MM_TRUE;
        }
        *value_out = 0u;
        return MM_TRUE;
    }
    (void)alias;
    ok = MM_FALSE;
    if (dev->read != 0) {
        ok = dev->read(dev, off, size, value_out);
    }
    if (!ok) {
        ok = mm_imxrt700_regfile_read(dev, off, size, value_out);
    }
    if (trace_enabled()) {
        fprintf(stderr, "[IMXRT700] rd %s+0x%03lx = 0x%08lx\n", dev->name, (unsigned long)off,
                (unsigned long)*value_out);
    }
    return ok;
}

static mm_bool window_write(void *opaque, mm_u32 offset, mm_u32 size, mm_u32 value)
{
    const mm_u8 *win = (const mm_u8 *)opaque;
    mm_u32 ns_addr = IMXRT700_PERIPH_BASE_NS + offset;
    mm_u32 off = 0;
    struct imxrt700_dev *dev;
    mm_bool ok;

    if (size == 0u || size > 4u) {
        return MM_FALSE;
    }
    dev = dev_lookup(ns_addr, &off, 0);
    access_secure = (*win == window_s) ? MM_TRUE : MM_FALSE;
    if (dev == 0) {
        if (!unmapped_warned || trace_enabled()) {
            fprintf(stderr, "[IMXRT700] write to unmapped peripheral address 0x%08lx (WI)\n",
                    (unsigned long)(ns_addr | (access_secure ? 0x10000000u : 0u)));
            unmapped_warned = MM_TRUE;
        }
        return MM_TRUE;
    }
    if (trace_enabled()) {
        fprintf(stderr, "[IMXRT700] wr %s+0x%03lx <= 0x%08lx\n", dev->name, (unsigned long)off,
                (unsigned long)value);
    }
    ok = MM_FALSE;
    if (dev->write != 0) {
        ok = dev->write(dev, off, size, value);
    }
    if (!ok) {
        ok = mm_imxrt700_regfile_write(dev, off, size, value);
    }
    return ok;
}

/* ------------------------------------------------------------------------ */
/* Interrupts                                                               */
/* ------------------------------------------------------------------------ */

void mm_imxrt700_bind_nvic(int core, struct mm_nvic *nvic)
{
    if (core == IMXRT700_CPU0 || core == IMXRT700_CPU1) {
        nvics[core] = nvic;
    }
}

struct mm_nvic *mm_imxrt700_nvic(int core)
{
    if (core == IMXRT700_CPU0 || core == IMXRT700_CPU1) {
        return nvics[core];
    }
    return 0;
}

void mm_imxrt700_irq_set(int core, int irq, mm_bool level)
{
    struct mm_nvic *n = mm_imxrt700_nvic(core);
    if (n == 0 || irq < 0) {
        return;
    }
    if (level) {
        mm_nvic_set_pending(n, (mm_u32)irq, MM_TRUE);
    }
}

/* ------------------------------------------------------------------------ */
/* Target hooks                                                             */
/* ------------------------------------------------------------------------ */

void mm_imxrt700_mmio_reset(void)
{
    devs_reset();
    crc_state = 0u;
    access_secure = MM_FALSE;
    unmapped_warned = MM_FALSE;
    mm_imxrt700_mc_reset();
    mm_imxrt700_secure_reset();
    mm_imxrt700_romapi_reset();
    mm_imxrt700_xspi_reset();
}

