danielinux/m33mu/cpu/imxrt700/imxrt700_mmio.c
static void attach_status_hooks(void)
{
    static const char *const status_devs[] = {
        "CLKCTL0", "CLKCTL2", "CLKCTL3", "FRO0", "FRO2", "OSC32KNP"
    };
    mm_u32 i;
    for (i = 0; i < sizeof(status_devs) / sizeof(status_devs[0]); ++i) {
        (void)mm_imxrt700_dev_hook(status_devs[i], status_read, 0, 0);
    }
}

mm_bool mm_imxrt700_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;
    char name[8];
    mm_u32 i;

    devs_build();
    if (!devs_ready) {
        return MM_FALSE;
    }
    attach_status_hooks();
    for (i = 0; i <= 10u; ++i) {
        snprintf(name, sizeof(name), "GPIO%lu", (unsigned long)i);
        (void)mm_imxrt700_dev_hook(name, gpio_read, gpio_write, 0);
    }
    (void)mm_imxrt700_dev_hook("CRC", crc_read, crc_write, 0);
    mm_imxrt700_flexcomm_attach();
    mm_imxrt700_timers_attach();
    mm_imxrt700_mc_attach();
    mm_imxrt700_secure_attach();
    mm_imxrt700_xspi_attach();

    memset(&reg, 0, sizeof(reg));
    reg.base = IMXRT700_PERIPH_BASE_NS;
    reg.size = PERIPH_WINDOW_SIZE;
    reg.opaque = (void *)&window_ns;
    reg.read = window_read;
    reg.write = window_write;
    if (!mmio_bus_register_region(bus, &reg)) {
        return MM_FALSE;
    }
    reg.base = IMXRT700_PERIPH_BASE_S;
    reg.opaque = (void *)&window_s;
    if (!mmio_bus_register_region(bus, &reg)) {
        return MM_FALSE;
    }
    return mm_imxrt700_romapi_register_mmio(bus);
}

void mm_imxrt700_flash_bind(struct mm_memmap *map,
                            mm_u8 *flash,
                            mm_u32 flash_size,
                            const struct mm_flash_persist *persist,
                            mm_u32 flags)
{
    (void)flags;
    bound_map = map;
    bound_flash = flash;
    bound_flash_size = flash_size;
    mm_imxrt700_xspi_bind(flash, flash_size, persist);
    mm_imxrt700_secure_flash_bind(flash, flash_size);
}

struct mm_memmap *mm_imxrt700_memmap(void)
{
    return bound_map;
}

mm_u8 *mm_imxrt700_flash(mm_u32 *size_out)
{
    if (size_out != 0) {
        *size_out = bound_flash_size;
    }
    return bound_flash;
}

mm_u64 mm_imxrt700_cpu_hz(void)
{
    /* CPU0 main clock out of the boot ROM (SystemCoreClock default). */
    return 192000000ull;
}

void mm_imxrt700_periph_init(struct mmio_bus *bus, struct mm_nvic *nvic)
{
    (void)bus;
    mm_imxrt700_bind_nvic(IMXRT700_CPU0, nvic);
}

void mm_imxrt700_periph_reset(void)
{
    mm_imxrt700_flexcomm_reset();
    mm_imxrt700_timers_reset();
}

void mm_imxrt700_periph_poll(void)
{
    mm_imxrt700_flexcomm_poll();
}

void mm_imxrt700_tick(mm_u64 cycles)
{
    mm_imxrt700_timers_tick(cycles);
    mm_imxrt700_mc_poll();
}

/* ------------------------------------------------------------------------ */
/* Boot ROM model                                                           */
/* ------------------------------------------------------------------------ */

#define FCB_TAG 0x42464346u /* "FCFB" */
#define IVT_OFFSET_XSPI 0x4000u
#define IMG_LENGTH_OFF 0x20u
#define IMG_EXEC_ADDR_OFF 0x34u
#define RAM_LOAD_MIN_OFF 0x15000u /* ROM owns the first 84 KB of SRAM during boot */

static mm_u32 rd32(const mm_u8 *p)
{
    return (mm_u32)p[0] | ((mm_u32)p[1] << 8) | ((mm_u32)p[2] << 16) | ((mm_u32)p[3] << 24);
}

static mm_bool ram_secure_offset(mm_u32 addr, mm_u32 *off_out)
{
    /* Any SRAM alias: code bus 0x0/0x10000000, system bus 0x20000000/0x30000000. */
    mm_u32 base = addr & 0xF0000000u;
    mm_u32 off = addr & 0x0FFFFFFFu;
    if ((base == 0x00000000u || base == 0x10000000u || base == 0x20000000u || base == 0x30000000u) &&
        off < IMXRT700_RAM_SIZE) {
        *off_out = off;
        return MM_TRUE;
    }
    return MM_FALSE;
}

mm_bool mm_imxrt700_boot_resolve(struct mm_memmap *map,
                                 const mm_u8 *flash,
                                 mm_u32 flash_size,
                                 mm_u32 *vtor_out)
{
    mm_u32 ivt;
    mm_u32 exec_addr;
    mm_u32 length;
    mm_u32 ram_off;
    mm_u32 i;

    if (flash == 0 || vtor_out == 0 || flash_size < IVT_OFFSET_XSPI + 0x40u) {
        return MM_FALSE;
    }
    if (rd32(flash) != FCB_TAG) {
        return MM_FALSE; /* raw image: vector table at offset 0 */
    }
    ivt = IVT_OFFSET_XSPI;
    exec_addr = rd32(flash + ivt + IMG_EXEC_ADDR_OFF);
    length = rd32(flash + ivt + IMG_LENGTH_OFF);
    if (exec_addr == 0u || exec_addr == 0xFFFFFFFFu) {
        *vtor_out = IMXRT700_FLASH_BASE_S + ivt;
        printf("[IMXRT700] boot: XIP from XSPI0, vector table 0x%08lx\n", (unsigned long)*vtor_out);
        return MM_TRUE;
    }
    if (!ram_secure_offset(exec_addr, &ram_off) || ram_off < RAM_LOAD_MIN_OFF ||
        length == 0u || length > flash_size - ivt || ram_off + length > IMXRT700_RAM_SIZE) {
        fprintf(stderr, "[IMXRT700] boot: invalid load-to-RAM image (exec=0x%08lx len=0x%lx)\n",
                (unsigned long)exec_addr, (unsigned long)length);
        return MM_FALSE;
    }
    for (i = 0; i < length; ++i) {
        (void)mm_memmap_write_ram_raw(map, IMXRT700_RAM_BASE_S + ram_off + i, 1u, flash[ivt + i]);
    }
    *vtor_out = exec_addr;
    printf("[IMXRT700] boot: loaded 0x%lx bytes to RAM, vector table 0x%08lx\n",
           (unsigned long)length, (unsigned long)*vtor_out);
    return MM_TRUE;
}
